cases/microfluidic/Pe52/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9728;
        startFace       1198080;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          51200;
        startFace       1207808;
    }
    inlet
    {
        type            patch;
        nFaces          256;
        startFace       1259008;
    }
    outlet
    {
        type            patch;
        nFaces          256;
        startFace       1259264;
    }
)

// ************************************************************************* //
