cases/microfluidic/Pe52/constant/solid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solid;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//solid density
rhos            rhos [1 -3 0 0 0 0 0] 2165;



// ************************************************************************* //
