cases/microfluidic/Pe52/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "epsSolid.*"
    {
        solver          diagonal;
    }


    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-8;
        relTol          0;
    }

    "(U|e|Y)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.01;
    }

    "(U|e|Y)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
    }

}


PIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    nCorrectors       2;   
	nOuterCorrectors  1;

    outerCorrectorResidualControl
    {
        U    
        {
            tolerance  1e-6;
            relTol     0;
        }	
        Y    
        {
            tolerance  1e-6;
            relTol     0;
        }

        p_rgh      
        {
            tolerance  1e-6;
            relTol     0;
        }       
    }
}

relaxationFactors
{
    fields
    {
        p_rgh      0.7;
        p_rghFinal   1;
    }
    equations
    {
        "Y"            0.7;
        "U"            0.7;
		//"p_rgh"            0.7;
    }
    equations
    {
        "YFinal"            1.0;
        "UFinal"            1.0;
        //"p_rgh"             1.0;
    }
}


// ************************************************************************* //
